#include <iostream> 
using namespace std;
int main()
{

	// loops
	// for-while- do while 
	// break-cont
	// nested loop
  
	// -----------------------------------------------------------------
	// 
	int counter = 1;
	while (counter <= 5) {
		cout << counter << " ";
		counter++; // تحديث العداد لمنع الحلقة اللانهائية 
	}
	cout << endl;
	// الناتج المتوقع
	// 1 2 3 4 5

	// -----------------------------------------------------------------

	int number;
	do {
		cout << "Enter a positive number: ";
		cin >> number;
	} while (number <= 0); // تستمر في الطلب طالما الرقم صفر أو سالب  
	cout << endl;



	// -----------------------------------------------------------------

	for (int i = 2; i <= 10; i += 2) {
		cout << i << " ";
	}

	// الناتج المتوقع
	// 2 4 6 8 10  
	cout << endl;

	// -----------------------------------------------------------------

	for (int i = 1; i <= 5; i++) {
		if (i == 3) {
			continue; // تخطي الرقم 3 فقط 
		}
		cout << i << " ";
	}
	// الناتج المتوقع
	// 1 2 4 5  
	cout << endl;

	// -----------------------------------------------------------------


	int x = 5;
	for (int i = 1; i <= 10; i++) {
		if (i == x) {
			cout << "Found it! ";
			break; // الخروج من الحلقة عند الوصول للرقم 5  
		}
		cout << i << " ";
	}
	// الناتج المتوقع
	// 1 2 3 4 Found it!
	cout << endl;

	// -----------------------------------------------------------------

	int n = 5;
	long long factorial = 1; // بدأنا بـ 1 لأننا نستخدم الضرب  
	for (int i = 1; i <= n; i++) {
		factorial *= i; // تعني fact = fact * i  
	} 
	// الناتج المتوقع لـ !5 هو: 120  
	cout << endl;
	// -----------------------------------------------------------------

	// رسم مثلث من النجوم
	for (int row = 1; row <= 4; row++) { // الصفوف  
		for (int col = 1; col <= row; col++) { // النجوم في كل صف  
			cout << "*";
		}
		cout << endl; // سطر جديد بعد كل صف  
	}

	/* الناتج المتوقع 
	*
	**
	***
	****
	*/

	// -----------------------------------------------------------------

	for (int i = 1; i <= 5; i++)
	{
		for (int j = 0; j < 5 - i; j++)
		{
			cout << " ";
		}
		for (int j = 0; j < i; j++)
		{
			cout << i << " ";
		}
		cout << endl;
	}
	/* 
	1
   2 2
  3 3 3
 4 4 4 4
5 5 5 5 5 
	*/
}
